Tekla Open API Reference for Tekla Structures 2025
Rotation3D.FromZRotation Method
Creates Rotation3D which represents rotation around the Z axis.
 Namespace: Tekla.Structures.Model.Geometry
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static Rotation3D FromZRotation(
	Angle angle
)
Public Shared Function FromZRotation (
	angle As Angle
) As Rotation3D
Parameters
angle
Type: Tekla.Structures.Datatype.Angle
The rotation andle.
Return Value
Type: Rotation3D
Rotation3D instance whcih represents the Z rotation.
See Also
Reference
Rotation3D Class
Tekla.Structures.Model.Geometry Namespace